[
  {
    "content": "A number of years ago I was going through a job search. I had wanted to apply for hybrid analysts positions but was encouraged to pursue developer roles. In the end, I had final round interviews with two companies. One asked me about whether Java passes objects by value or by reference. Another asked me to do a recursion problem and a parsing challenge. \nI was offered a job at both companies. But I was also convinced that I’d gotten lucky with the interview questions. Every bone in my body thought I needed to make it clear to the companies that I didn’t know what I was doing, the only programming concepts I knew happened to be the ones they asked me! \nI eventually accepted one of the offers and consistently out performed expectations. I was certain I didn’t belong in a developer role, that I didn’t have actual coding skills, but I belonged in that room. And so do you."
  },
  {
    "content": "A software developer’s confidence throughout their life: \n0 years experience: I have no idea what’s going on\n5 years experience: I AM A SENIOR DEVELOPER I CAN BUILD ANYTHING GET OUTTA MY WAY\n10/15 years experience: I like my personal life\n20 years experience: I AM AN IMPOSTOR"
  },
  {
    "content": "I quit computer science, my sophomore year of college. I was just totally new to programming, I had just started to learn that year. I had just learned Python, and I thought it was magical. You could type stuff into a computer and something else would come out. You could build all these games and super fun things. Then I took my second class, which was in C++, and I didn’t really understand it. Python has all these things like lists built into them. Why would you ever use C++ because there’s less built into it? You have to write more code to do the same thing, and you have to deal with pointers and all that. I thought that I wasn’t good at it. I was pulling all-nighters. We had to implement a Sudoku solver using backtracking in one of the first weeks of class. And I had no idea what I was doing; it was so hard. I spent so much time on it. On top of that, I felt like a lot of people in the computer science department didn’t look like me. They didn’t have the same interests to me, none of that. And so I felt like I really didn’t fit in. After that semester, I ended up quitting computer science and thought that it wasn’t for me"
  }
]
